 #define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int main()
//{	
//	 >> :右移操作符。
//	一般采用算术移位：即①右边丢弃，左边补原符号。
//						  ②逻辑右移：右边丢弃，左边补0；
//	内存存的是补码，打印的是反码。
//	正数的原，补，反码相同。
//	负数原码，反码，补码。
//	例:-1；原码：1000 0000 0000 0001
//		   反码：1111 1111 1111 1110
//		   补码：1111 1111 1111 1111（反码+1）
//	例：
//	int x = 6;//0000 0000 0000 0110
//	int y = x >> 1;//0000 0000 0000 0011
//	printf("y=%d\n", y);
//	 << :左移操作符。
//	右边丢弃，左边补0；
//	例：
//	int x = 6;//0000 0000 0000 0110
//	int y = x << 1;//0000 0000 0000 1100
//	printf("y=%d\n", y);
//	return 0;
//}
//int main()
//{	// & :按位与；
//
//	//int a = 3;//011
//	//int b = 5;//101
//	//int c = 0;
//	//c = a & b;//011&101=001
//	//printf("c=%d\n", c);
//
//	// | :按位或；
//
//	//int a = 3;//011
//	//int b = 5;//101
//	//int c = 0;
//	//c = a | b;//011|101=111
//	//printf("c=%d\n", c);
//	
//	// ^:按位异或；
//
//	//int a = 3;//011
//	//int b = 5;//101
//	//int c = 0;
//	//c = a ^ b;//011^101=110
//	//printf("c=%d\n", c);
//	//return 0;
//}

//int main()
//{	
//	//复合赋值符（+=，-=，*=，/=，%=，>>=，<<=，&=，|=，^= ）
//	int a = 10;
//	a = a + 2;//=>a+=2;
//	printf("%d\n", a);
//	a += 2;
//	printf("%d\n", a);
//	return 0;
//}
int main()
{
	//单目操作符：！& * 
	int a = 10;
	int* p = &a;
	*p = 20;
	printf("%d", a);//a=20
	return 0;
}
//int main()
//{
//	int n = 0;
//	int i = 0;
//	int sum = 0;
//	scanf("%d", &n);
//	for (i = 1; i < n; i++)
//	{
//
//		if (n % i == 0)
//		{
//			sum = sum + i;
//
//		}
//		
//	}
//
//	if (sum == n)
//	{
//		printf("yes,%d的因子是：", n);
//		for (i = 1; i < n; i++)
//		{
//			if (n % i == 0)
//			{
//				printf("%d ", i);
//			}
//		}
//		printf("\n");
//	}
//	else
//		printf("No\n");
//
//	return 0;
//}

//int main()
//{	
//	char ret = 'a';
//	printf("%d", ret);
//	return 0;
//}
